---
kind: other
id: Methods.T:Autodesk.Revit.Exceptions.OperationCanceledException
source: html/5381dc86-1e43-cf1c-cf0f-6353832341ff.htm
---
# OperationCanceledException Methods

Retrieves data needed to serialize the target object.